; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))

  (:action grasp
             :parameters (?h - hand ?c - container) ; container -- shot or shaker
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  ;; shot = 小さなコップ。
  (:action fill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s) ; 右手はコップを持ってる
                              (handempty ?h2)  ; おそらく左手でボタンを押す
	   		      (dispenses ?d ?i) ; 液体?
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i)) ; 同じ種類のカクテルの場合は再利用
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  ;; 飲み残しがあれば?空にする?
  (:action empty-shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean-shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  ;; シェーカーをつかう 片手
  (:action pour-shot-to-clean-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)    ; まだ混ぜてない
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d) ; 混ぜてない
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))))
 )

; problem
(DEFINE (PROBLEM BARMAN-LOOP-BASE-4)
 (:DOMAIN BARMAN)
 (:OBJECTS L2 - LEVEL
           L1 - LEVEL
           L0 - LEVEL
           DISPENSER11 - DISPENSER
           DISPENSER10 - DISPENSER
           DISPENSER9 - DISPENSER
           DISPENSER8 - DISPENSER
           DISPENSER7 - DISPENSER
           DISPENSER6 - DISPENSER
           DISPENSER5 - DISPENSER
           DISPENSER4 - DISPENSER
           DISPENSER3 - DISPENSER
           DISPENSER2 - DISPENSER
           DISPENSER1 - DISPENSER
           COCKTAIL11 - COCKTAIL
           COCKTAIL10 - COCKTAIL
           COCKTAIL9 - COCKTAIL
           COCKTAIL8 - COCKTAIL
           COCKTAIL7 - COCKTAIL
           COCKTAIL6 - COCKTAIL
           COCKTAIL5 - COCKTAIL
           COCKTAIL4 - COCKTAIL
           COCKTAIL3 - COCKTAIL
           COCKTAIL2 - COCKTAIL
           COCKTAIL1 - COCKTAIL
           INGREDIENT11 - INGREDIENT
           INGREDIENT10 - INGREDIENT
           INGREDIENT9 - INGREDIENT
           INGREDIENT8 - INGREDIENT
           INGREDIENT7 - INGREDIENT
           INGREDIENT6 - INGREDIENT
           INGREDIENT5 - INGREDIENT
           INGREDIENT4 - INGREDIENT
           INGREDIENT3 - INGREDIENT
           INGREDIENT2 - INGREDIENT
           INGREDIENT1 - INGREDIENT
           RIGHT - HAND
           LEFT - HAND
           SHAKER1 - SHAKER
           BASE0-6028 - SHOT
           BASE1-6027 - SHOT
           BASE2-6026 - SHOT
           BASE3-6025 - SHOT)

 (:INIT
  (COCKTAIL-PART2 COCKTAIL11 INGREDIENT10)
  (COCKTAIL-PART1 COCKTAIL11 INGREDIENT4)
  (COCKTAIL-PART2 COCKTAIL10 INGREDIENT11)
  (COCKTAIL-PART1 COCKTAIL10 INGREDIENT4)
  (COCKTAIL-PART2 COCKTAIL9 INGREDIENT6)
  (COCKTAIL-PART1 COCKTAIL9 INGREDIENT4)
  (COCKTAIL-PART2 COCKTAIL8 INGREDIENT6)
  (COCKTAIL-PART1 COCKTAIL8 INGREDIENT7)
  (COCKTAIL-PART2 COCKTAIL7 INGREDIENT8)
  (COCKTAIL-PART1 COCKTAIL7 INGREDIENT5)
  (COCKTAIL-PART2 COCKTAIL6 INGREDIENT7)
  (COCKTAIL-PART1 COCKTAIL6 INGREDIENT2)
  (COCKTAIL-PART2 COCKTAIL5 INGREDIENT11)
  (COCKTAIL-PART1 COCKTAIL5 INGREDIENT2)
  (COCKTAIL-PART2 COCKTAIL4 INGREDIENT2)
  (COCKTAIL-PART1 COCKTAIL4 INGREDIENT11)
  (COCKTAIL-PART2 COCKTAIL3 INGREDIENT1)
  (COCKTAIL-PART1 COCKTAIL3 INGREDIENT4)
  (COCKTAIL-PART2 COCKTAIL2 INGREDIENT5)
  (COCKTAIL-PART1 COCKTAIL2 INGREDIENT11)
  (COCKTAIL-PART2 COCKTAIL1 INGREDIENT2)
  (COCKTAIL-PART1 COCKTAIL1 INGREDIENT11)
  (NEXT L1 L2)
  (NEXT L0 L1)
  (SHAKER-LEVEL SHAKER1 L0)
  (SHAKER-EMPTY-LEVEL SHAKER1 L0)
  (HANDEMPTY RIGHT)
  (HANDEMPTY LEFT)
  (EMPTY SHAKER1)
  (CLEAN SHAKER1)
  (DISPENSES DISPENSER11 INGREDIENT11)
  (DISPENSES DISPENSER10 INGREDIENT10)
  (DISPENSES DISPENSER9 INGREDIENT9)
  (DISPENSES DISPENSER8 INGREDIENT8)
  (DISPENSES DISPENSER7 INGREDIENT7)
  (DISPENSES DISPENSER6 INGREDIENT6)
  (DISPENSES DISPENSER5 INGREDIENT5)
  (DISPENSES DISPENSER4 INGREDIENT4)
  (DISPENSES DISPENSER3 INGREDIENT3)
  (DISPENSES DISPENSER2 INGREDIENT2)
  (DISPENSES DISPENSER1 INGREDIENT1)
  (ONTABLE SHAKER1)
  (EMPTY BASE0-6028)
  (EMPTY BASE1-6027)
  (EMPTY BASE2-6026)
  (EMPTY BASE3-6025)
  (CLEAN BASE0-6028)
  (CLEAN BASE1-6027)
  (CLEAN BASE2-6026)
  (CLEAN BASE3-6025)
  (ONTABLE BASE0-6028)
  (ONTABLE BASE1-6027)
  (ONTABLE BASE2-6026)
  (ONTABLE BASE3-6025))
 (:GOAL
  (AND (CONTAINS BASE0-6028 COCKTAIL10)
       (CONTAINS BASE1-6027 COCKTAIL10)
       (CONTAINS BASE2-6026 COCKTAIL10)
       (CONTAINS BASE3-6025 COCKTAIL10))))

; plan
1. (grasp right base1-6027)
   deleted: (ontable base1-6027) (handempty right)
   added: (holding right base1-6027)
   goals met: 0 of 4
2. (fill-shot base1-6027 ingredient4 right left dispenser4)
   deleted: (empty base1-6027) (clean base1-6027)
   added: (contains base1-6027 ingredient4) (used base1-6027 ingredient4)
   goals met: 0 of 4
3. (pour-shot-to-clean-shaker base1-6027 ingredient4 shaker1 right l0 l1)
   deleted: (contains base1-6027 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty base1-6027) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 4
4. (clean-shot base1-6027 ingredient4 right left)
   deleted: (used base1-6027 ingredient4)
   added: (clean base1-6027)
   goals met: 0 of 4
5. (fill-shot base1-6027 ingredient11 right left dispenser11)
   deleted: (empty base1-6027) (clean base1-6027)
   added: (contains base1-6027 ingredient11) (used base1-6027 ingredient11)
   goals met: 0 of 4
6. (pour-shot-to-used-shaker base1-6027 ingredient11 shaker1 right l1 l2)
   deleted: (contains base1-6027 ingredient11) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient11) (empty base1-6027) (shaker-level shaker1 l2)
   goals met: 0 of 4
7. (clean-shot base1-6027 ingredient11 right left)
   deleted: (used base1-6027 ingredient11)
   added: (clean base1-6027)
   goals met: 0 of 4
8. (leave right base1-6027)
   deleted: (holding right base1-6027)
   added: (handempty right) (ontable base1-6027)
   goals met: 0 of 4
9. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 4
10. (shake cocktail10 ingredient4 ingredient11 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient11)
   added: (shaked shaker1) (contains shaker1 cocktail10)
   goals met: 0 of 4
11. (pour-shaker-to-shot cocktail10 base0-6028 left shaker1 l2 l1)
   deleted: (clean base0-6028) (empty base0-6028) (shaker-level shaker1 l2)
   added: (contains base0-6028 cocktail10) (shaker-level shaker1 l1)
   goals met: 1 of 4
12. (empty-shaker left shaker1 cocktail10 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail10)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 1 of 4
13. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 1 of 4
14. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 1 of 4
15. (grasp right base2-6026)
   deleted: (ontable base2-6026) (handempty right)
   added: (holding right base2-6026)
   goals met: 1 of 4
16. (fill-shot base2-6026 ingredient4 right left dispenser4)
   deleted: (empty base2-6026) (clean base2-6026)
   added: (contains base2-6026 ingredient4) (used base2-6026 ingredient4)
   goals met: 1 of 4
17. (pour-shot-to-clean-shaker base2-6026 ingredient4 shaker1 right l0 l1)
   deleted: (contains base2-6026 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty base2-6026) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 1 of 4
18. (clean-shot base2-6026 ingredient4 right left)
   deleted: (used base2-6026 ingredient4)
   added: (clean base2-6026)
   goals met: 1 of 4
19. (fill-shot base2-6026 ingredient11 right left dispenser11)
   deleted: (empty base2-6026) (clean base2-6026)
   added: (contains base2-6026 ingredient11) (used base2-6026 ingredient11)
   goals met: 1 of 4
20. (pour-shot-to-used-shaker base2-6026 ingredient11 shaker1 right l1 l2)
   deleted: (contains base2-6026 ingredient11) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient11) (empty base2-6026) (shaker-level shaker1 l2)
   goals met: 1 of 4
21. (clean-shot base2-6026 ingredient11 right left)
   deleted: (used base2-6026 ingredient11)
   added: (clean base2-6026)
   goals met: 1 of 4
22. (leave right base2-6026)
   deleted: (holding right base2-6026)
   added: (handempty right) (ontable base2-6026)
   goals met: 1 of 4
23. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 4
24. (shake cocktail10 ingredient4 ingredient11 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient11)
   added: (shaked shaker1) (contains shaker1 cocktail10)
   goals met: 1 of 4
25. (pour-shaker-to-shot cocktail10 base1-6027 left shaker1 l2 l1)
   deleted: (clean base1-6027) (empty base1-6027) (shaker-level shaker1 l2)
   added: (contains base1-6027 cocktail10) (shaker-level shaker1 l1)
   goals met: 2 of 4
26. (empty-shaker left shaker1 cocktail10 l1 l0)
   deleted: (shaked shaker1) (shaker-level shaker1 l1) (contains shaker1 cocktail10)
   added: (shaker-level shaker1 l0) (empty shaker1)
   goals met: 2 of 4
27. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 2 of 4
28. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 2 of 4
29. (grasp right base3-6025)
   deleted: (ontable base3-6025) (handempty right)
   added: (holding right base3-6025)
   goals met: 2 of 4
30. (fill-shot base3-6025 ingredient4 right left dispenser4)
   deleted: (empty base3-6025) (clean base3-6025)
   added: (contains base3-6025 ingredient4) (used base3-6025 ingredient4)
   goals met: 2 of 4
31. (pour-shot-to-clean-shaker base3-6025 ingredient4 shaker1 right l0 l1)
   deleted: (contains base3-6025 ingredient4) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty base3-6025) (contains shaker1 ingredient4) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 2 of 4
32. (clean-shot base3-6025 ingredient4 right left)
   deleted: (used base3-6025 ingredient4)
   added: (clean base3-6025)
   goals met: 2 of 4
33. (fill-shot base3-6025 ingredient11 right left dispenser11)
   deleted: (empty base3-6025) (clean base3-6025)
   added: (contains base3-6025 ingredient11) (used base3-6025 ingredient11)
   goals met: 2 of 4
34. (pour-shot-to-used-shaker base3-6025 ingredient11 shaker1 right l1 l2)
   deleted: (contains base3-6025 ingredient11) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient11) (empty base3-6025) (shaker-level shaker1 l2)
   goals met: 2 of 4
35. (clean-shot base3-6025 ingredient11 right left)
   deleted: (used base3-6025 ingredient11)
   added: (clean base3-6025)
   goals met: 2 of 4
36. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 2 of 4
37. (leave right base3-6025)
   deleted: (holding right base3-6025)
   added: (handempty right) (ontable base3-6025)
   goals met: 2 of 4
38. (shake cocktail10 ingredient4 ingredient11 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient4) (contains shaker1 ingredient11)
   added: (shaked shaker1) (contains shaker1 cocktail10)
   goals met: 2 of 4
39. (pour-shaker-to-shot cocktail10 base2-6026 left shaker1 l2 l1)
   deleted: (clean base2-6026) (empty base2-6026) (shaker-level shaker1 l2)
   added: (contains base2-6026 cocktail10) (shaker-level shaker1 l1)
   goals met: 3 of 4
40. (pour-shaker-to-shot cocktail10 base3-6025 left shaker1 l1 l0)
   deleted: (clean base3-6025) (empty base3-6025) (shaker-level shaker1 l1)
   added: (contains base3-6025 cocktail10) (shaker-level shaker1 l0)
   goals met: 4 of 4
